app/views/no_percs/index.html.erb

  <strong>Jump to:</strong>
  <%- NoPerc.pagination_letters.each do |letter| -%>
---
SELECT "no_percs".* FROM "no_percs" WHERE (composer_name >= 'a') ORDER BY composer_name LIMIT 1