app/views/composers/index.html.erb

  <strong><%= I18n.t 'composers.jump' %></strong>
  <%- Composer.pagination_letters.each do |letter| -%>
---
SELECT "composers".* FROM "composers" WHERE (composer_name >= 'a') ORDER BY composer_name LIMIT 1