app/controllers/composers_controller.rb

SELECT "composers".* FROM "composers" WHERE "composers"."id" = 1 LIMIT 1
SELECT "works".* FROM "works" WHERE ("works".composer_id = 1) ORDER BY work_order_id
---
  def show
    @composer = Composer.find(params[:id])
    @works = @composer.works.find(:all, :order => 'work_order_id')