app/controllers/endorsements_controller.rb

  def index
    @endorsements = Endorsement.all
---
SELECT * FROM "endorsements"

  def show
    @endorsement = Endorsement.find(params[:id])
---
SELECT * FROM "endorsements" WHERE ("endorsements"."id" = 0)

  def edit
    @endorsement = Endorsement.find(params[:id])
---
SELECT * FROM "endorsements" WHERE ("endorsements"."id" = 28)

  def create
    @endorsement = Endorsement.new(params[:endorsement])

    respond_to do |format|
      if @endorsement.save
---
INSERT INTO "endorsements" ("name", "company", "created_at", "job_title", "body", "updated_at", "email") VALUES('Edward Cervenka', 'Perc', '2011-04-09 13:40:44', 'Manager', 'Test message', '2011-04-09 13:40:44', 'ed_cervenka@hotmail.com')

  def destroy
    @endorsement = Endorsement.find(params[:id])
    @endorsement.destroy
---
SELECT * FROM "endorsements" WHERE ("endorsements"."id" = 10)
DELETE FROM "endorsements" WHERE "id" = 10