app/controllers/no_percs_controller.rb

  def index
    @no_percs = NoPerc.all
---
SELECT "no_percs".* FROM "no_percs" WHERE (composer_name >= 'a') ORDER BY composer_name LIMIT 1