app/controllers/sessions_controller.rb

  def create
    user = User.authenticate(params[:session][:email],
                             params[:session][:password])
    if user.nil?
      flash.now[:error] = "Invalid email/password combination."
      @title = "Sign in"
      render 'new'
    else
      sign_in user
      flash[:message] = "Welcome to the members area " + user.first_name + ". Click the links above and to the right to navigate."
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'email@example.com' LIMIT 1