app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("first_name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('New User', 'user@example.com', '2011-04-29 15:45:42.532017', '2011-04-29 15:45:42.532017', '919fe496ba1cabe5688760fed164041fea7b6d8db11888232f437859695974fb', '646cca81374d054ec83ced22afa16718e68c93305aeb1b1fe67e8a957d195817')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "first_name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = 'e1f813a84103898c2a649ffcea3e2c9477ea3d7260b5bff144416ef2433f2093', "updated_at" = '2011-05-03 15:46:44.247148' WHERE "users"."id" = 1