app/controllers/work_requests_controller.rb

SELECT "work_requests".* FROM "work_requests"
---
  def index
    @work_requests = WorkRequest.all

SELECT * FROM "work_requests" WHERE ("work_requests"."id" = 1)
---
  def show
    @work_request = WorkRequest.find(params[:id])

INSERT INTO "work_requests" ("name", "company", "composer_name", "created_at", "job_title", "updated_at", "date", "work_name", "email") VALUES('Edward Cervenka', '', 'Brahms', '2011-04-18 19:34:05', 'Manager', '2011-04-18 19:34:05', 'Yesterday', 'Some piece', 'ed_cervenka@hotmail.com')
---
  def create
    @work_request = WorkRequest.new(params[:work_request])

    respond_to do |format|
      if @work_request.save