app/controllers/works_controller.rb

SELECT "works".* FROM "works" WHERE "works"."id" = 1 LIMIT 1
SELECT * FROM "workdetails" WHERE ("workdetails".work_id = 225) ORDER BY movement_id
SELECT "workdetails".* FROM "workdetails" WHERE ("workdetails".work_id = 1) LIMIT 1
---
   def show
     @work = Work.find(params[:id])
     @workdetails = @work.workdetails.order("movement_id")

     @workdetail = @work.workdetails.order.first