app/views/instrument_translations/index.html.erb

SELECT "instrument_translations".* FROM "instrument_translations" WHERE (instrument_name >= 'a') ORDER BY instrument_name LIMIT 1
---
  <strong>Jump to:</strong>
  <%- InstrumentTranslation.pagination_letters.each do |letter| -%>